Repository: iplus-framework/iPlus
Catalog: gip.tool.installerAndUpdater/TextResources/TextResource.*.resx
Languages: de_de

# TbLicenseText
source: GIPSOFT D.O.O. SOFTWARE LICENSE TERMS IPLUS, IPLUS.MES These license terms are an agreement between you and GIPSOFT D.O.O.. They apply to the software named above. The terms also apply to any GIPSOFT services and updates for the software, except to the extent those have different terms. BY INSTALLING, HAVING INSTALLED, SUBSCRIBING TO, OR USING THE SOFTWARE, YOU ACCEPT THIS AGREEMENT (INCLUDING ANY MODIFICATIONS MADE TO IT FROM TIME TO TIME). IF YOU DO NOT ACCEPT THIS AGREEMENT, DO NOT INSTALL, HAVE INSTALLED, SUBSCRIBE TO, OR USE THE SOFTWARE. If an individual enters into this agreement on behalf of a legal entity, that individual represents that he or she has the authority to bind that entity to this agreement. DEFINITIONS • „iPlus“. The Software „iPlus“ functions as both development and runtime environment. • An „Application project“ is the overall application created by the development environment, delivered to the end-user by an integrator or created by the end-user himself. • „Integrators“ are companies or partners that create application projects for end-users or provide services based on the iPlus platform. • A „product package“ is a collection of software components that run through the runtime system. Product packages can be created and licensed by integrators. • „iPlus-MES“ is a collection of product packages that GIPSOFT itself licenses. • License types o A „DLI“ (Developer License Issuer) is a development license to use the development environment. A DLI allows you to create your own product packages and their product licenses. o A „DLC“ (Developer License Consumer) is a development license for end users to use the development environment. A DLC enables customization on the product packages and the resulting application project. o A „PL“ (Product License) is a product license for a product package. o A „SAL“ (Server Access License) is a license to use one or more application projects that are deployed as a network service. o A „CAL“ (Client Access License) means client access license. TRIAL EDITION USE RIGHTS If the software is a trial edition, this Section applies to your use of the trial edition. You have a trial version as long as you don’t have a DLI-, DLC- or PL-License. A. GENERAL. You may use any number of copies of the trial edition on your devices. You may only use the trial edition • for internal evaluation purposes, • or as a test environment, that does not cause any damage of any kind. You may not distribute or deploy any applications you make with the trial edition to a production environment. B. TRIAL PERIOD AND CONVERSION. The trial period is unlimited and ends with the purchase of a developer dongle. The projects you created during the trial period can be further developed when you purchase a DLI- or DLC-License. C. DISCLAIMER OF WARRANTY. THE TRIAL EDITION IS LICENSED “AS-IS.” YOU BEAR THE RISK OF USING IT. GIPSOFT GIVES NO EXPRESS WARRANTIES, GUARANTEES OR CONDITIONS. TO THE EXTENT PERMITTED UNDER YOUR LOCAL LAWS, GIPSOFT EXCLUDES THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. D. SUPPORT. Because the trial edition is “as is” we may not provide support services for it. E. LIMITATIONS ON DAMAGES. YOU CAN RECOVER FROM GIPSOFT ONLY DIRECT DAMAGES UP TO 5.00 EUR. YOU CANNOT RECOVER ANY OTHER DAMAGES, INCLUDING CONSEQUENTIAL, LOST PROFITS, SPECIAL, INDIRECT OR INCIDENTAL DAMAGES. This limitation applies to (a) anything related to the trial version, services, content (including code) on third party Internet sites, or third party programs; and (b) claims for breach of contract, breach of warranty, guarantee or condition, strict liability, negligence, or other tort to the extent permitted by applicable law. It also applies even if gipSoft knew or should have known about the possibility of the damages. The above limitation or exclusion may not apply to you because your country may not allow the exclusion or limitation of incidental, consequential or other damages. FULL-USE LICENSE TERMS FOR THE SOFTWARE When you acquire a valid license, the terms below apply. 1) OVERVIEW. a) Software. The software includes • development tools, • server software, • client software, • applications for distributing and installing the server and client software, • maybe product packages (iPlus-MES), • database files and • documentation. b) Licensing. The software is licensed differently depending on the application: i. Development license. To use the software as a development environment, you need a development license (DLI or DLC) licensed on a per user basis. Development licenses are shipped on dongles and can only be created by GIPSOFT. DLI licenses can only be purchased directly from GIPSOFT. Dongles with DLC licenses can also be purchased from integrators that own a DLI license. ii. Product license. A product license (PL) is required to use the runtime environment when product packages from "iPlus-MES" are used in production mode. A product license is issued as a license key per database file. iii. Licensing by third parties. Licensing by server (SAL) or client access (CAL) is not provided for under this agreement. However, integrators who hold a DLI license may agree to such licensing in another contract. This licensing then refers to the application projects that are created and delivered to the end customer. An integrator who holds a DLI license may also create and issue product licenses (PL) for its own product packages. c) License Model. The software is licensed under two models: i. Perpetual License Model – Under this model, you have licensed the software under perpetual license terms, as code that is installed on your premises or hosted for you by a third party acting as your agent (“Perpetual License Model”). The Perpetual License Model is applied to product licenses (PL). ii. Subscription License Model – Under this model, you have licensed the software on a per user basis for a limited period. This license model is applied development licenses (DLI, DLC). 2) USE RIGHTS. a) General. One user may use copies of the software and install it on any number of computers unless a third party license exists (see section 1.b.iii) in which something else has been agreed. i) A User with a development license may (1) work on multiple installations at the same time, (2) create application projects that use product packages that require a product license without owning a product license. The application project will then run as a trial version. A development license cannot be shared by multiple persons. ii) An owner of a product license is entitled to use the unlocked product packages through an unlimited number of network clients provided that they all access the same database file on which the product license has been activated. The same product license cannot and must not be enabled on multiple database files at the same time. Multiple product licenses for different product packages can be activated on a database file at the same time. b) Transfer of licenses If you are a valid licensee of the software, you may transfer it and this agreement directly to another party. Before the transfer, that party must agree that this agreement applies to the transfer and use of the software. i) Transfer of development licenses The transfer must include the software and the developer dongle. ii) Transfer of product licenses A product license can be transferred to another database instance when the database file is migrated. However, this requires a new software key to be generated for each product package that you request from the product package vendor. In this case, you must provide the vendor with proof that you have destroyed the database file on which the original product license was located. c) Demo Use. The use permitted above includes use of the software in demonstrating your applications. d) Backup copy. You may make multiple copies of the software for backup, development and testing purposes, so long as such copies are not used in production and the development or testing is for your internal business purpose only. 3) TERMS FOR SPECIFIC COMPONENTS. a) Other development tools. If you use third-party development environments or build tools to create your own assemblies based on the iPlus framework, the third-party license terms also apply. b) Third party components. The software may include third party components with separate legal notices or governed by other agreements. c) Database. The software requires Microsoft's SQL-Server software, which is not ship with this software. You are responsible for the procurement, installation, management and maintenance of SQL Server software and database files. 4) DISTRIBUTABLE CODE. The software contains code that you are permitted to distribute in applications you develop as described in this Section. (For this Section the term “distribution” also means deployment of your applications for third parties to access over the Internet.) The term "code" also includes program code and all configurations that are stored in the database file and can be created, modified, and deleted using the iPlus development environment or other database manipulating software. a) Right to Use and Distribute. • Modifications to the code in the database file. You have the right to modify, extend, copy, and distribute changes to the code stored in the database file. If the original code is modified, the liability and warranty will pass to you. GIPSOFT is not responsible for any problems that result from modifications made to the software. • Code samples and templates for assembly code. You may modify, copy, and distribute the source codes and templates that can be downloaded from the documentation page to create your own assemblies. • Own Distribution. You may copy and distribute all assemblies and SQL-Database-Files installed on your computer by the iPlus installation program. • Third Party Distribution. You may permit distributors of your applications to copy and distribute the Distributable Code as part of those applications. b) Distribution Requirements. For any Distributable Code you distribute, you must: • add significant primary functionality to it in your applications; • require distributors and external end users to agree to terms that protect the Distributable Code at least as much as this agreement; and • indemnify, defend, and hold harmless GIPSOFT from any claims, including attorneys’ fees, related to the distribution or use of your applications, except to the extent that any claim is based solely on the Distributable Code. c) Distribution Restrictions. You may not: • use GIPSOFT’s trademarks in your applications’ names or in a way that suggests your applications come from or are endorsed by GIPSOFT; or • modify or distribute the source code of any Distributable Code so that any part of it becomes subject to an Excluded License. An Excluded License is one that requires, as a condition of use, modification or distribution of code, that (i) it be disclosed or distributed in source code form; or (ii) others have the right to modify it. 5) DATA COLLECTION. The software may collect information about you and your use of the software and send that to GIPSOFT. GIPSOFT may use this information to provide services and improve GIPSOFT’s products and services. Your opt-out rights, if any, are described in the product documentation. Some features in the software may enable collection of data from users of your applications that access or use the software. If you use these features to enable data collection in your applications, you must comply with applicable law, including getting any required user consent, and maintain a prominent privacy policy that accurately informs users about how you use, collect, and share their data. 6) DOCUMENTATION. Any person that has valid access to your computer or internal network may copy and use the documentation for your internal, reference purposes. 7) UPDATES. Updates and patches are available for download on the website. The installation of the update must be done manually. GIPSOFT also has the right to provide automatic updates in the future. An update may mean that the self-developed programs and created application projects need to be adapted. 8) SCOPE OF LICENSE. The software is licensed, not sold. This agreement only gives you some rights to use the software. GIPSOFT reserves all other rights. Unless applicable law gives you more rights despite this limitation, you may use the software only as expressly permitted in this agreement. In doing so, you must comply with any technical limitations in the software that only allow you to use it in certain ways. You may not • work around any technical limitations in the software; • reverse engineer, decompile or disassemble the software, or otherwise attempt to derive the source code for the software, except and to the extent required by third party licensing terms governing use of certain open source components that may be included in the software; • remove, minimize, block or modify any notices of GIPSOFT or its suppliers in the software; • use the software in any way that is against the law; • share, publish, rent or lease the software, or provide the software as a stand-alone offering for others to use; • modify the content of the developer dongle. 9) PARTICIPATING OBLIGATIONS OF THE LICENSEE a) The licensee is obligated to document possible defects in the software as comprehensibly as possible for the licensor and to inform the licensor immediately. In doing so, he will take into account the information provided by the licensor for the purpose of analyzing the problem within the limits of what is reasonable for him and forward all information available to him for the elimination of the defect to the licensor. b) The licensee must take appropriate precautions to protect the software from unauthorized access by third parties. This also applies to the rights to access the database file. c) Licensee will take reasonable precautions in the event that the software fails to operate properly, in whole or in part (e.g. through regular updates to the operating system, appropriate protection against malicious software, regular data backup, fault diagnosis, periodic review of data processing results). d) The licensee is obliged to update the software to the latest version and to install the updates or patches provided by the licensor, unless this would be unreasonable for licensees (e.g. because the latest software version is faulty). e) The licensee bears disadvantages and additional costs from a violation of these obligations. 10) PROOF OF LICENSE. a) Development license. The dongle is used as proof of license. If the subscription is cancelled, the dongle must be returned to GIPSOFT. b) Product license. The license key and the invoice are used as proof of license. 11) DOWNGRADE. You have no rights to use earlier versions of the software under this license and GIPSOFT is not obligated to supply earlier versions to you. 12) EXPORT RESTRICTIONS. You must comply with all domestic and international export laws and regulations that apply to the software, which include restrictions on destinations, end users, and end use. 13) SUPPORT. GIPSOFT provides support for the software as described by contacting GIPSOFT by e-Mail at info@gipsoft.eu. Support may be subject to a charge. 14) ENTIRE AGREEMENT. This agreement (including the warranty below), and the terms for supplements, updates, Internet-based services and support services, are the entire agreement for the software and support services. 15) APPLICABLE LAW. The laws of the country in which you purchased the software apply. 16) CONSUMER RIGHTS; REGIONAL VARIATIONS. This agreement describes certain legal rights. You may have other rights, including consumer rights, under the laws of your state or country. Separate and apart from your relationship with GIPSOFT, you may also have rights with respect to the party from which you acquired the software. This agreement does not change those other rights if the laws of your state, province, or country do not permit it to do so. For example, if you acquired the software in one of the below regions, or mandatory country law applies, then the following provisions apply to you: a) Australia. You have statutory guarantees under the Australian Consumer Law and nothing in this agreement is intended to affect those rights. b) Germany and Austria. i) Warranty. The properly licensed software will perform substantially as described in any GIPSOFT materials that accompany the software. However, GIPSOFT gives no contractual guarantee in relation to the licensed software. ii) Limitation of Liability. In case of intentional conduct, gross negligence, claims based on the Product Liability Act, as well as, in case of death or personal or physical injury, GIPSOFT is liable according to the statutory law. Subject to the foregoing clause (ii), GIPSOFT will only be liable for slight negligence if GIPSOFT is in breach of such material contractual obligations, the fulfillment of which facilitate the due performance of this agreement, the breach of which would endanger the purpose of this agreement and the compliance with which a party may constantly trust in (so-called "cardinal obligations"). In other cases of slight negligence, GIPSOFT will not be liable for slight negligence. 17) LIMITATION ON AND EXCLUSION OF DAMAGES. YOU CAN RECOVER FROM GIPSOFT AND ITS SUPPLIERS ONLY DIRECT DAMAGES UP TO THE AMOUNT YOU PAID FOR THE SOFTWARE. YOU CANNOT RECOVER ANY OTHER DAMAGES, INCLUDING CONSEQUENTIAL, LOST PROFITS, SPECIAL, INDIRECT OR INCIDENTAL DAMAGES. This limitation applies to • anything related to the software, services, content (including code) on third party Internet sites, or third party applications; and • claims for breach of contract, breach of warranty, guarantee or condition, strict liability, negligence, or other tort to the extent permitted by applicable law. It also applies • repair, replacement or a refund for the software does not fully compensate you for any losses; or • even if GIPSOFT knew or should have known about the possibility of the damages. Some states do not allow the exclusion or limitation of incidental or consequential damages, so the above limitation or exclusion may not apply to you. They also may not apply to you because your country may not allow the exclusion or limitation of incidental, consequential or other damages. ************************************************************************* LIMITED WARRANTY A. LIMITED WARRANTY. If you follow the instructions, the software will perform substantially as described in the GIPSOFT materials that you receive in or with the software. References to “limited warranty” are references to the express warranty provided by GIPSOFT. This warranty is given in addition to other rights and remedies you may have under law, including your rights and remedies in accordance with the statutory guarantees under local Consumer Law. B. TERM OF WARRANTY; WARRANTY RECIPIENT; LENGTH OF ANY IMPLIED WARRANTIES. THE LIMITED WARRANTY COVERS THE SOFTWARE FOR ONE YEAR AFTER ACQUIRED BY THE FIRST USER. IF YOU RECEIVE SUPPLEMENTS, UPDATES, OR REPLACEMENT SOFTWARE DURING THAT YEAR, THEY WILL BE COVERED FOR THE REMAINDER OF THE WARRANTY OR 30 DAYS, WHICHEVER IS LONGER. If the first user transfers the software, the remainder of the warranty will apply to the recipient. TO THE EXTENT PERMITTED BY LAW, ANY IMPLIED WARRANTIES, GUARANTEES OR CONDITIONS LAST ONLY DURING THE TERM OF THE LIMITED WARRANTY. Some states do not allow limitations on how long an implied warranty lasts, so these limitations may not apply to you. They also might not apply to you because some countries may not allow limitations on how long an implied warranty, guarantee or condition lasts. C. EXCLUSIONS FROM WARRANTY. This warranty does not cover problems caused by your acts (or failures to act), the acts of others, or events beyond GIPSOFT’s reasonable control. D. REMEDY FOR BREACH OF WARRANTY. GIPSOFT WILL REPAIR OR REPLACE THE SOFTWARE AT NO CHARGE. IF GIPSOFT CANNOT REPAIR OR REPLACE IT, GIPSOFT WILL REFUND THE AMOUNT SHOWN ON YOUR RECEIPT FOR THE SOFTWARE. IT WILL ALSO REPAIR OR REPLACE SUPPLEMENTS, UPDATES AND REPLACEMENT SOFTWARE AT NO CHARGE. IF GIPSOFT CANNOT REPAIR OR REPLACE THEM, IT WILL REFUND THE AMOUNT YOU PAID FOR THEM, IF ANY. YOU MUST UNINSTALL THE SOFTWARE AND RETURN ANY MEDIA AND OTHER ASSOCIATED MATERIALS TO GIPSOFT WITH PROOF OF PURCHASE TO OBTAIN A REFUND. THESE ARE YOUR ONLY REMEDIES FOR BREACH OF THE LIMITED WARRANTY. E. CONSUMER RIGHTS NOT AFFECTED. YOU MAY HAVE ADDITIONAL CONSUMER RIGHTS UNDER YOUR LOCAL LAWS, WHICH THIS AGREEMENT CANNOT CHANGE. F. WARRANTY PROCEDURES. You need proof of purchase for warranty service. For warranty service or information about how to obtain a refund for software please contact GIPSOFT via E-Mail at adress info@gipsoft.eu. G. NO OTHER WARRANTIES. THE LIMITED WARRANTY IS THE ONLY DIRECT WARRANTY FROM GIPSOFT. GIPSOFT GIVES NO OTHER EXPRESS WARRANTIES, GUARANTEES OR CONDITIONS. WHERE ALLOWED BY YOUR LOCAL LAWS, GIPSOFT EXCLUDES IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. If your local laws give you any implied warranties, guarantees or conditions, despite this exclusion, your remedies are described in the Remedy for Breach of Warranty clause above, to the extent permitted by your local laws. FOR AUSTRALIA ONLY. References to “Limited Warranty” are references to the warranty provided by GIPSOFT. This warranty is given in addition to other rights and remedies you may have under law, including your rights and remedies in accordance with the statutory guarantees under the Australian Consumer Law. Our goods come with guarantees that cannot be excluded under the Australian Consumer Law. You are entitled to a replacement or refund for a major failure and compensation for any other reasonably foreseeable loss or damage. You are also entitled to have the goods repaired or replaced if the goods fail to be of acceptable quality and the failure does not amount to a major failure. Goods presented for repair may be replaced by refurbished goods of the same type rather than being replaced. Refurbished parts may be used to repair the goods. H. LIMITATION ON AND EXCLUSION OF DAMAGES FOR BREACH OF WARRANTY. THE LIMITATION ON AND EXCLUSION OF DAMAGES CLAUSE ABOVE APPLIES TO BREACHES OF THIS LIMITED WARRANTY. THIS WARRANTY GIVES YOU SPECIFIC LEGAL RIGHTS, AND YOU MAY ALSO HAVE OTHER RIGHTS WHICH VARY FROM STATE TO STATE. YOU MAY ALSO HAVE OTHER RIGHTS WHICH VARY FROM COUNTRY TO COUNTRY.
de_de: GIPSOFT D.O.O. SOFTWARELIZENZBESTIMMUNGEN IPLUS, IPLUS-MES Diese Lizenzbestimmungen sind ein Vertrag zwischen Ihnen und der GIPSOFT D.O.O.. Sie gelten für die oben angeführte Software. Die Bestimmungen gelten auch für alle GIPSOFT-Dienste und Updates für die Software, es sei denn, dass diese abweichende Bestimmungen haben. DURCH DIE INSTALLATION, BEREITS ERFOLGTE INSTALLATION ODER VERWENDUNG DER SOFTWARE ERKENNEN SIE DIESEN VERTRAG AN (EINSCHLIESSLICH ETWAIGER ÄNDERUNGEN, DIE DARAN VON ZEIT ZU ZEIT VORGENOMMEN WERDEN). FALLS SIE DIESEN VERTRAG NICHT AKZEPTIEREN, SIND SIE NICHT BERECHTIGT, DIE SOFTWARE ZU INSTALLIEREN, INSTALLIERT ZU LASSEN, ZU ABONNIEREN ODER ZU VERWENDEN. Wenn eine Person diesen Vertrag im Namen einer juristischen Person schließt, sichert diese Person zu, dass sie die Befugnis besitzt, diese juristische Person an den Vertrag zu binden. DEFINITIONEN • „iPlus“. Die Software „iPlus“ ist zugleich eine Entwicklungs- und eine Laufzeitumgebung. • Ein „Anwendungsprojekt“ ist die mit Hilfe der Entwicklungsumgebung erstellte Gesamtanwendung, die an den Endnutzer von einem Integrator ausgeliefert wird oder auch vom Endnutzer selbst erstellt worden ist. • „Integratoren“ sind Firmen oder Partner die Anwendungsprojekte für Endnutzer erstellen oder Dienstleistungen auf Basis der iPlus-Plattform erbringen. • Ein „Produktpaket“ ist eine Sammlung von Softwarekomponenten, die mittels Laufzeitumgebung ausgeführt werden. Produktpakete können von Integratoren erstellt und lizensiert werden. • „iPlus-MES“ ist eine Sammlung an Produktpaketen die GIPSOFT selbst lizensiert. • Lizenztypen o Eine „DLI“ (Developer License Issuer) ist eine Entwicklungslizenz zur Nutzung der Entwicklungsumgebung. Eine DLI ermöglicht die Erstellung eigener Produktpakete und deren Produktlizenzen. o Eine „DLC“ (Developer License Consumer) ist eine Entwicklungslizenz für Endanwender zur Nutzung der Entwicklungsumgebung. Eine DLC ermöglicht es kundenspezifische Erweiterungen an den Produktpaketen und des daraus hervorgegangenen Anwendungsprojektes durchführen zu können. o Eine „PL“ (Product License) ist eine Produktlizenz für ein Produktpaket. o Eine „SAL“ (Server Access License) ist eine Lizenz für die Nutzung eines oder mehreren Anwendungsprojekte, die als Netzwerkdienst bereitgestellt werden. o Eine „CAL“ (Client Access License) ist eine Client-Zugriffslizenz. RECHTE ZUR NUTZUNG VON TESTVERSIONEN Wenn es sich bei der Software um eine Testversion handelt, gilt dieser Abschnitt für Ihre Nutzung der Testversion. Eine Testversion ist dann gegeben solange Sie weder eine DLI-, DLC- oder PL-Lizenz besitzen. A. ALLGEMEINES. Sie sind berechtigt, eine beliebige Anzahl von Kopien der Testversion auf Ihren Geräten zu verwenden. Sie dürfen die Testversion nur • für interne Bewertungszwecke, • oder als Testumgebung verwenden, bei der keine Schäden jeglicher Art entstehen können. Sie sind nicht berechtigt, Anwendungsprojekte, die Sie mit der Testversion erstellen, an eine Produktionsumgebung zu verteilen oder dort bereitzustellen. B. TESTZEITRAUM UND KONVERTIERUNG. Die Probezeit ist unbegrenzt und endet mit dem Erwerb einer der drei angeführten Lizenztypen. Die Anwendungsprojekte, die Sie während der Probezeit erstellt haben können Sie nach dem Erwerb einer DLI- oder DLC-Lizenz weiter entwickeln. C. AUSSCHLUSS VON GARANTIEN. DIE TESTVERSION WIRD ALS „WIE VERFÜGBAR“ LIZENSIERT. SIE TRAGEN DAS MIT DER NUTZUNG VERBUNDENE RISIKO. GIPSOFT GEWÄHRT KEINE AUSDRÜCKLICHEN GEWÄHRLEISTUNGEN ODER GARANTIEN. IN DEM NACH IHREM ÖRTLICH ANWENDBAREN RECHT ZULÄSSIGEN UMFANG SCHLIEßT GIPSOFT KONKLUDENTE GARANTIEN DER HANDELSÜBLICHKEIT, EIGNUNG FÜR EINEN BESTIMMTEN ZWECK UND NICHTVERLETZUNG VON RECHTEN DRITTER AUS. D. SUPPORT. Da wir die Testversion „wie besehen“ zur Verfügung stellen, stellen wir möglicherweise keine Supportservices dafür bereit. E. SCHADENSBESCHRÄNKUNGEN. SIE KÖNNEN VON GIPSOFT UND DEREN LIEFERANTEN NUR EINEN ERSATZ FÜR DIREKTE SCHÄDEN BIS ZU EINEM BETRAG VON 5 EUR ERHALTEN. SIE KÖNNEN KEINEN ERSATZ FÜR ANDERE SCHÄDEN ERHALTEN, EINSCHLIEßLICH FOLGESCHÄDEN, SCHÄDEN AUS ENTGANGENEM GEWINN, SPEZIELLE, INDIREKTE ODER ZUFÄLLIGE SCHÄDEN. Diese Beschränkung gilt für (a) alles im Zusammenhang mit Testversion, Diensten, Inhalt (einschließlich Code) von Internetsites oder Programmen von Drittanbietern und (b) für Ansprüche aus Vertragsverletzung, Verletzung von Gewährleistung, Garantie oder Bedingungen, verschuldensunabhängiger Haftung, Fahrlässigkeit oder anderer unerlaubter Handlung, soweit gesetzlich zulässig. Sie hat auch dann Gültigkeit, wenn GIPSOFT von der Möglichkeit der Schäden gewusst hat oder hätte wissen müssen. Obige Beschränkung und obiger Ausschluss gelten möglicherweise nicht für Sie, weil Ihr Land den Ausschluss oder die Beschränkung von zufälligen Schäden, Folgeschäden oder sonstigen Schäden nicht gestattet. Wenn Sie die Software in DEUTSCHLAND oder in ÖSTERREICH erworben haben, findet die Beschränkung im vorstehenden Absatz „Beschränkung und Ausschluss von Schadenersatz“ auf Sie keine Anwendung. Stattdessen gelten für Schadenersatz oder Ersatz vergeblicher Aufwendungen, gleich aus welchem Rechtsgrund einschließlich unerlaubter Handlung, die folgenden Regelungen: GIPSOFT haftet bei Vorsatz, grober Fahrlässigkeit, bei Ansprüchen nach dem Produkthaftungsgesetz sowie bei Verletzung von Leben, Körper oder der Gesundheit nach den gesetzlichen Vorschriften. GIPSOFT haftet nicht für leichte Fahrlässigkeit. Wenn Sie die Software jedoch in Deutschland erworben haben, haftet GIPSOFT auch für leichte Fahrlässigkeit, wenn GIPSOFT eine Vertragspflicht verletzt, deren Erfüllung die ordnungsgemäße Durchführung des Vertrags überhaupt erst ermöglicht, deren Verletzung die Erreichung des Vertragszwecks gefährdet und auf deren Einhaltung Sie regelmäßig vertrauen dürfen (sog. „Kardinalpflichten“). In diesen Fällen ist die Haftung von GIPSOFT auf typische und vorhersehbare Schäden beschränkt. In allen anderen Fällen haftet GIPSOFT auch in Deutschland nicht für leichte Fahrlässigkeit. BESTIMMUNGEN FÜR DIE LIZENZ ZUR VOLLSTÄNDIGEN VERWENDUNG DER SOFTWARE Wenn Sie eine gültige Lizenz erwerben, gelten die nachstehenden Bestimmungen. 1) ÜBERBLICK. a) Software. Die Software enthält • Entwicklungswerkzeuge, • Serversoftware, • Clientsoftware, • Programme zur Verteilung und Installation der Server- und Clientsoftware, • eventuell Produktpakete (iPlus-MES), • Datenbankdateien und • Dokumentation b) Lizensierung. Die Software wird je nach Anwendungszweck unterschiedlich lizensiert: i. Entwicklungslizenz. Für die Nutzung der Software als Entwicklungsumgebung benötigen Sie eine Entwicklungslizenz (DLI oder DLC) die auf Nutzerbasis lizenziert wird. Entwicklungslizenzen werden auf Dongles ausgeliefert und können somit nur von GIPSOFT erstellt werden. DLI-Lizenzen können nur direkt bei GIPSOFT erworben werden. Dongles mit DLC-Lizenzen können auch bei Integratoren, die eine DLI-Lizenz besitzen, erworben werden. ii. Produktlizenz. Für die Nutzung der Laufzeitumgebung ist eine Produktlizenz (PL) nötig wenn Produktpakete von iPlus-MES im Produktivbetrieb eingesetzt werden. Eine Produktlizenz wird pro Datenbankdatei als Lizenzschlüssel ausgestellt. iii. Lizensierung durch Dritte. Eine Lizenzierung nach Server (SAL)- oder Clientzugriff (CAL) ist im Rahmen dieses Vertrags nicht vorgesehen. Jedoch dürfen Integratoren, die eine DLI-Lizenz besitzen, eine solche Lizensierung in einem anderen Vertrag vereinbaren. Diese Lizensierung bezieht sich dann auf die erstellten Anwendungsprojekte, die an den Endkunden ausgeliefert werden. Ein Integrator, der eine DLI-Lizenz besitzt darf auch Produktlizenzen (PL) für seine selbst entwickelten Produktpakete erstellen und herausgeben. c) Lizenzmodell. Die Software wird auf Basis von zwei Modellen lizenziert: i. Zeitlich unbeschränktes Lizenzmodell – Unter diesem Modell haben Sie die Software unter zeitlich unbeschränkten Lizenzbestimmungen als Code lizenziert, der in Ihren Geschäftsräumen installiert ist oder von einem Dritten, der als Ihr Vertreter fungiert, für Sie gehostet wird („Zeitlich unbeschränktes Lizenzmodell“). Das zeitlich unbeschränkte Lizenzmodell wird für Produktlizenzen (PL) angewendet. ii. Abonnementlizenzmodell – Unter diesem Modell haben Sie die Software auf Nutzerbasis für einen beschränkten Zeitraum lizenziert. Dieses Lizenzmodell wird auf Entwicklungslizenzen (DLI, DLC) angewendet. 2) NUTZUNGSRECHTE. a) Allgemeine Bestimmungen. Ein Nutzer ist berechtigt, Kopien der Software zu erstellen und sie auf beliebig vielen Rechnern zu installieren sofern nicht eine Lizensierung durch Dritte (Siehe Abschnitt 1.b.iii) besteht in der etwas anderes vereinbart wurde. i) Ein Nutzer mit einer Entwicklungslizenz darf (1) zeitgleich an mehreren Installationen arbeiten, (2) Anwendungsprojekte erstellen, die Produktpakete nutzen für die eine Produktlizenz erforderlich ist ohne selbst eine Produktlizenz zu besitzen. Das Anwendungsprojekt läuft dann als Testversion. Eine Entwicklungslizenz kann nicht von mehreren Personen gemeinsam verwendet werden. ii) Ein Besitzer einer Produktlizenz ist berechtigt das freigeschaltete Produktpaket durch eine unbegrenzte Anzahl an Netzwerkclients zu nutzen sofern sie alle auf die selbe Datenbankdatei zugreifen auf der die Produktlizenz aktiviert wurde. Die selbe Produktlizenz kann und darf nicht gleichzeitig auf mehreren Datenbankdateien aktiviert sein. Auf einer Datenbankdatei können gleichzeitig mehrere Produktlizenzen für unterschiedliche Produktpakete aktiviert sein. b) Übertragung von Lizenzen. Als berechtigter Lizenznehmer der Software sind Sie berechtigt, diese und den Vertrag direkt an eine andere Partei abzutreten. Vor der Übertragung muss sich die andere Partei damit einverstanden erklären, dass dieser Vertrag für die Übertragung und Nutzung der Software gilt. i) Übertragung von Entwicklungslizenzen Die Übertragung muss die Software und den Dongle umfassen. ii) Übertragung von Produktlizenzen Eine Produktlizenz kann bei einer Migration der Datenbankdatei auf eine andere Datenbankinstanz übertragen werden. Dafür muss jedoch erneut ein neuer Softwareschlüssel für jedes Produktpaket generiert werden den Sie bei dem Anbieter des Produktpaketes beantragen. In diesem Fall müssen Sie dem Anbieter einen Nachweis erbringen, dass Sie die Datenbankdatei auf der sich die ursprüngliche Produktlizenz befunden hat vernichtet haben. c) Demo-Verwendung. Die vorstehend ausgeführte zulässige Verwendung beinhaltet die Verwendung der Software zur Demonstration Ihrer Anwendungen. d) Sicherungskopie. Sie sind berechtigt, mehrere Kopien der Software zu Sicherungs-, Entwicklungs- und Testzwecken zu erstellen, solange derartige Kopien nicht in der Produktion verwendet werden und die Entwicklung oder Tests nur für Ihre internen Geschäftszwecke bestimmt sind. 3) BESTIMMUNGEN FÜR SPEZIFISCHE KOMPONENTEN. a) Andere Entwicklungswerkzeuge. Falls Sie Entwicklungsumgebungen oder Buildwerkzeuge von Drittanbietern nutzen, um ihre eigenen Assemblys zu erstellen, die auf dem iPlus-Framework basieren, dann gelten zusätzlich die Lizenzbedingungen des Drittanbieters. b) Lizenzen für andere Komponenten. Diese Software kann Komponenten Dritter enthalten, die gesonderten rechtlichen Anmerkungen oder anderen Verträgen unterliegen. c) Datenbanksoftware. Die Software benötigt die "SQL-Server"-Software von Microsoft, die nicht mit dieser Software ausgeliefert wird. Für die Beschaffung, Installation, Verwaltung und Wartung der SQL-Server Software und der Datenbankdateien sind Sie verantwortlich. 4) VERTREIBBARER CODE. Die Software enthält Code, den Sie wie in diesem Abschnitt beschrieben in von Ihnen entwickelten Anwendungen vertreiben dürfen. (Für diesen Abschnitt bedeutet der Begriff „Vertrieb“ auch die Bereitstellung Ihrer Anwendungen für den Zugriff durch Dritte über das Internet.) Der Begriff „Code“ umfasst auch Programmcode und alle Konfigurationen, die in der Datenbankdatei gespeichert sind und mit der iPlus-Entwicklungsumgebung oder anderer Datenbankänderungssoftware erstellt, modifiziert und gelöscht werden können. a) Recht zur Nutzung und zum Vertrieb. • Änderungen am Code in der Datenbankdatei. Sie sind berechtigt Änderungen am Code, der in der Datenbankdatei gespeichert ist, zu ändern, zu erweitern, zu kopieren und zu vertreiben. Bei Änderung des ursprünglich ausgelieferten Code geht die Haftung und Gewährleistung an Sie über. GIPSOFT ist nicht verantwortlich für irgendwelche Probleme, die durch Änderungen an der Software entstehen. • Codebeispiele und Vorlagen für Assemblycode. Sie sind berechtigt, die auf der Dokumentationsseite herunterladbaren Quellcodes und Vorlagen zur Erstellung eigener Assemblys zu ändern, zu kopieren und zu vertreiben. • Eigene Verteilung. Sie sind berechtigt alle Assemblies und SQL-Datenbank-Dateien, die mit dem iPlus Installationsprogramm installiert wurden, zu kopieren und zu vertreiben. • Verteilung an Dritte. Sie sind berechtigt, Distributoren Ihrer Anwendungen zu erlauben, den vertreibbaren Code als Teil dieser Anwendungen zu kopieren und zu vertreiben. b) Vertriebsbedingungen. Für vertreibbaren Code, den Sie vertreiben, sind Sie verpflichtet: • diesen in Ihren Anwendungen wesentliche primäre Funktionalität hinzuzufügen, • von Distributoren und externen Endbenutzern die Zustimmung zu Bestimmungen zu verlangen, die einen mindestens gleichwertigen Schutz für den vertreibbaren Code bieten wie dieser Vertrag; und • GIPSOFT von allen Ansprüchen freizustellen und gegen alle Ansprüche zu verteidigen, einschließlich Anwaltsgebühren, die mit dem Vertrieb oder der Verwendung Ihrer Anwendungen zusammenhängen, außer insoweit Ansprüche ausschließlich auf dem Vertreibbaren Code beruhen. c) Vertriebsbeschränkungen. Sie sind nicht dazu berechtigt, • die Marken von GIPSOFT in den Namen Ihrer Anwendungen oder auf eine Weise zu verwenden, die nahelegt, dass Ihre Anwendungen von GIPSOFT stammen oder von GIPSOFT empfohlen werden, oder • den Quellcode von vertreibbarem Code so zu ändern oder zu vertreiben, dass irgendein Teil von ihm einer ausgeschlossenen Lizenz unterliegt. Eine Ausgeklammerte Lizenz ist eine solche, die als Bedingung für Nutzung, Änderung oder Verteilung des Codes erfordert, dass (a) sie in Quellcodeform offen gelegt oder verteilt wird oder (b) andere das Recht haben, sie zu ändern. 5) DATENERFASSUNG. Die Software kann Informationen über Sie und die Nutzung der Software durch Sie erfassen und an GIPSOFT senden. GIPSOFT kann diese Informationen verwenden, um Dienste bereitzustellen und um Produkte und Dienste von GIPSOFT zu verbessern. Ihre etwaigen Rechte, dies auszuschließen, sind in der Produktdokumentation beschrieben. Einige Features in der Software ermöglichen eventuell die Datenerfassung von Nutzern Ihrer Anwendungen, die auf die Software zugreifen oder die Software nutzen. Wenn Sie diese Features zur Datenerfassung in Ihren Anwendungen nutzen, sind Sie zur Einhaltung von anwendbarem Recht, unter anderem zur Einholung einer erforderlichen Zustimmung des Nutzers, und dazu verpflichtet, eine einschlägige Datenschutzrichtlinie zur Information der Nutzer zu unterhalten, wie Sie deren Daten verwenden, erfassen und weitergeben. 6) DOKUMENTATION. Jede Person, die über einen gültigen Zugriff auf Ihren Computer oder Ihr internes Netzwerk verfügt, ist berechtigt, die Dokumentation zu Ihren internen Referenzzwecken zu kopieren und zu verwenden. 7) AKTUALISIERUNGEN. Aktualisierungen und Patches werden als Download auf der Internetseite bereitgestellt. Die Installation der Aktualisierung muss manuell durchgeführt werden. GIPSOFT hält sich das Recht vor in Zukunft auch automatische Aktualisierungen bereitzustellen. Eine Aktualisierung kann zur Folge haben, dass die selbst entwickelten Programme und erstellten Anwendungsprojekte angepasst werden müssen. 8) LIZENZUMFANG. Die Software wird lizenziert, nicht verkauft. Dieser Vertrag gewährt Ihnen lediglich bestimmte Rechte zur Nutzung der Software. Alle anderen Rechte verbleiben bei GIPSOFT. Sie dürfen die Software nur wie in diesem Vertrag ausdrücklich gestattet nutzen, es sei denn, anwendbares Recht gibt Ihnen ungeachtet dieser Einschränkung umfassendere Rechte. Dabei sind Sie verpflichtet, technische Beschränkungen zu beachten, die Ihnen die Nutzung der Software nur auf bestimmte Art und Weise ermöglichen. Sie sind nicht berechtigt • technische Beschränkungen der Software zu umgehen, • die Software zurückzuentwickeln, zu dekompilieren oder zu disassemblieren oder anderweitig zu versuchen, den Quellcode für die Software abzuleiten, ausgenommen und in dem Maße, wie dies in Lizenzierungsbedingungen für Dritte vorgesehen ist, die die Verwendung bestimmter Open-Source-Komponenten regeln, die in der Software enthalten sein können, • Benachrichtigungen von GIPSOFT oder Software-Lieferanten zu entfernen, minimieren, blockieren oder zu ändern, • die Software auf eine Weise zu verwenden, die gegen das Gesetz verstößt, • die Software gemeinsam zu nutzen, zu veröffentlichen oder zu verleihen oder die Software als eigenständiges Angebot für Nutzung durch andere bereitzustellen, • den Inhalt des Entwickler-Dongles zu verändern. 9) ANZEIGE- UND MITWIRKUNGSPFLICHTEN DES LIZENZNEHMERS. a) Der Lizenznehmer ist verpflichtet, etwaige auftretende Mängel an der Software in für den Lizenzgeber möglichst nachvollziehbarer Weise zu dokumentieren und dem Lizenzgeber unverzüglich zu melden. Er wird hierbei die Hinweise des Lizenzgebers zur Problemanalyse im Rahmen des ihm Zumutbaren berücksichtigen und alle ihm vorliegenden, für die Beseitigung des Mangels erforderlichen Informationen an den Lizenzgeber weiterleiten. b) Der Lizenznehmer hat geeignete Vorkehrungen zu treffen, um die Software vor dem unbefugten Zugriff Dritter zu schützen. Dies betrifft auch die Rechte für den Zugriff auf die Datenbankdatei. c) Der Lizenznehmer trifft angemessene Vorkehrungen für den Fall, dass die Software ganz oder teilweise nicht ordnungsgemäß arbeitet (z.B. durch regelmäßige Aktualisierungen des Betriebssystems, geeigneten Schutz vor Schadsoftware, regelmäßige Datensicherung, Störungsdiagnose, regelmäßige Überprüfung der Datenverarbeitungsergebnisse). d) Der Lizenznehmer ist verpflichtet, die Software auf dem aktuellen Stand einzusetzen und die vom Lizenzgeber bereitgestellten Updates oder Patches einzuspielen, es sei denn, dies wäre für Lizenznehmer nicht zumutbar (z.B. weil die neueste Softwareversion fehlerhaft ist). e) Der Lizenznehmer trägt Nachteile und Mehrkosten aus einer Verletzung dieser Pflichten. 10) LIZENZNACHWEIS. a) Entwicklungslizenz. Als Lizenznachweis dient der Dongle. Wird das Abonnement gekündigt muss der Dongle an GIPSOFT zurückgegeben werden. b) Produktlizenz. Als Lizenznachweis dient der Lizenzschlüssel und die Rechnung. 11) DOWNGRADE. Unter dieser Lizenz verfügen Sie nicht über Rechte zur Verwendung früherer Versionen der Software, und GIPSOFT ist nicht verpflichtet, Ihnen frühere Versionen zur Verfügung zu stellen. 12) EXPORTBESCHRÄNKUNGEN. Sie müssen alle nationalen und internationalen Exportgesetze und -bestimmungen einhalten, die für die Software gelten, darunter Beschränkungen für Bestimmungsorte, Endbenutzer und Endnutzung. 13) SUPPORT. GIPSOFT stellt für die beschriebene Software Support per E-Mail, unter der Adresse info@gipsoft.eu, zur Verfügung. Der Support kann ggf. kostenpflichtig sein. 14) GESAMTER VERTRAG. Dieser Vertrag (einschließlich nachstehender Garantie) sowie die Bestimmungen für Ergänzungen, Aktualisierungen, internetbasierte Dienste und Supportleistungen stellen den Gesamtvertrag über die Software und Supportdienste dar. 15) ANWENDBARES RECHT. Es gelten die Gesetze des Landes, in dem Sie die Software gekauft haben. 16) VERBRAUCHERRECHTE; REGIONALE VARIATIONEN. Dieser Vertrag beschreibt bestimmte gesetzliche Rechte. Möglicherweise sehen die Gesetze Ihres Staats oder Lands andere Rechte vor, einschließlich Verbraucherrechte. Unabhängig von Ihrer Vertragsbeziehung mit GIPSOFT haben Sie möglicherweise auch Rechte gegenüber der Partei, von der Sie die Software erworben haben. Dieser Vertrag ändert diese anderen Rechte nicht, wenn die Gesetze Ihres Staats oder Lands eben dies ausschließen. Wenn Sie die Software beispielsweise in einer der unten genannten Regionen erworben haben oder zwingendes Recht des Landes Anwendung findet, gelten die folgenden Bestimmungen für Sie: a) Australien. Nach dem Australian Consumer Law gelten gesetzliche Garantien, und es besteht an keiner Stelle dieses Vertrags die Absicht, diese Rechte einzuschränken. b) Deutschland und Österreich. i) Gewährleistung. Die ordnungsgemäß lizenzierte Software wird im Wesentlichen wie in den GIPSOFT-Materialien, die der Software beiliegen, beschrieben arbeiten. GIPSOFT übernimmt jedoch keine vertragliche Garantie in Bezug auf die lizenzierte Software. ii) Haftungsbeschränkung. Bei Vorsatz, grober Fahrlässigkeit, bei Ansprüchen nach dem Produkthaftungsgesetz sowie bei Verletzung von Leben, Körper oder Gesundheit haftet GIPSOFT nach den gesetzlichen Bestimmungen. Vorbehaltlich der vorangegangenen Klausel (ii) haftet GIPSOFT nur dann für leichte Fahrlässigkeit, wenn GIPSOFT diejenigen wesentlichen Vertragspflichten verletzt, deren Erfüllung die ordnungsgemäße Durchführung dieses Vertrags überhaupt erst ermöglicht, deren Verletzung den Zweck dieses Vertrags gefährden würde und auf deren Einhaltung eine Partei regelmäßig vertrauen darf (sogenannte „Kardinalpflichten“). In anderen Fällen von leichter Fahrlässigkeit haftet GIPSOFT nicht. 17) BESCHRÄNKUNG UND AUSSCHLUSS VON SCHADENERSATZ. SIE KÖNNEN VON GIPSOFT UND DEREN LIEFERANTEN NUR EINEN ERSATZ FÜR DIREKTE SCHÄDEN BIS ZU DEM BETRAG ERHALTEN, DEN SIE FÜR DIE SOFTWARE GEZAHLT HABEN. SIE KÖNNEN KEINEN ERSATZ FÜR ANDERE SCHÄDEN ERHALTEN, EINSCHLIESSLICH FOLGESCHÄDEN, SCHÄDEN AUS ENTGANGENEM GEWINN, SPEZIELLER, INDIREKTER ODER ZUFÄLLIGER SCHÄDEN. Diese Einschränkung gilt für • jeden Gegenstand im Zusammenhang mit der Software, Diensten, Inhalten (einschließlich Code) auf Internetseiten von Drittanbietern oder Anwendungen von Dritten und • Ansprüche aus Vertragsverletzungen, Verletzungen der Garantie oder der Gewährleistung, verschuldensunabhängiger Haftung, Fahrlässigkeit oder anderen unerlaubten Handlungen im durch das anwendbare Recht zugelassenen Umfang. Sie hat auch dann Gültigkeit, • wenn Nachbesserung, Nachlieferung oder Erstattung des Kaufpreises für die Software Sie nicht vollständig für Verluste entschädigt oder • wenn GIPSOFT von der Möglichkeit der Schäden gewusst hat oder hätte wissen müssen. Einige Staaten und Länder gestatten den Ausschluss oder die Beschränkung von zufälligen oder Folgeschäden nicht. Daher gelten die obigen Beschränkungen und Ausschlüsse möglicherweise nicht für Sie. Sie gelten möglicherweise nicht für Sie, weil Ihr Land den Ausschluss oder die Beschränkung von zufälligen Schäden, Folgeschäden oder sonstigen Schäden nicht gestattet. Wenn Sie die Software in DEUTSCHLAND oder in ÖSTERREICH erworben haben, findet die Beschränkung im vorstehenden Absatz „Beschränkung und Ausschluss des Schadenersatzes“ auf Sie keine Anwendung. Stattdessen gelten für Schadenersatz oder Ersatz vergeblicher Aufwendungen, gleich aus welchem Rechtsgrund einschließlich unerlaubter Handlung, die folgenden Regelungen: GIPSOFT haftet bei Vorsatz, grober Fahrlässigkeit, bei Ansprüchen nach dem Produkthaftungsgesetz sowie bei Verletzung von Leben, Körper oder der Gesundheit nach den gesetzlichen Vorschriften. GIPSOFT haftet nicht für leichte Fahrlässigkeit. Wenn Sie die Software jedoch in Deutschland erworben haben, haftet GIPSOFT auch für leichte Fahrlässigkeit, wenn GIPSOFT eine Vertragspflicht verletzt, deren Erfüllung die ordnungsgemäße Durchführung des Vertrages überhaupt erst ermöglicht, deren Verletzung die Erreichung des Vertragszwecks gefährdet und auf deren Einhaltung Sie regelmäßig vertrauen dürfen (sog. „Kardinalpflichten“). In diesen Fällen ist die Haftung von GIPSOFT auf typische und vorhersehbare Schäden beschränkt. In allen anderen Fällen haftet GIPSOFT auch in Deutschland nicht für leichte Fahrlässigkeit. ************************************************************************* BESCHRÄNKTE GARANTIE A. BESCHRÄNKTE GARANTIE. Wenn Sie die Anweisungen befolgen, wird die Software im Wesentlichen arbeiten wie in den GIPSOFT-Materialien beschrieben, die Sie in oder mit der Software erhalten. Verweise auf „beschränkte Garantie“ sind Verweise auf die ausdrücklich von GIPSOFT gewährte Garantie. Diese Garantie wird zusätzlich zu anderen Rechten und Abhilfeansprüchen gewährt, die Sie möglicherweise nach dem Gesetz haben, einschließlich Ihrer Rechte und Abhilfeansprüche in Übereinstimmung mit den gesetzlichen Garantien nach der örtlich anwendbaren Verbrauchergesetzgebung. B. LAUFZEIT DER GARANTIE; GARANTIEEMPFÄNGER; DAUER VON KONKLUDENTEN GEWÄHRLEISTUNGEN. Die beschränkte Garantie gilt ein Jahr ab dem Erwerb der Software durch den ersten Nutzer. Wenn Sie während dieses Jahres Ergänzungen, Updates oder Ersatzsoftware erhalten, fallen diese für den Rest des Garantiezeitraums oder 30 Tage lang unter die beschränkte Garantie, wobei der längere Zeitraum maßgeblich ist. Wenn der erste Nutzer die Software überträgt, gilt für den Empfänger der restliche Zeitraum der Garantie. Im durch das anwendbare Recht zugelassenen Umfang gelten Implied Warranties oder Implied Guarantees (konkludente Gewährleistungen oder Garantien) nur während der Laufzeit der beschränkten Garantie. Einige Bundesstaaten gestatten keine zeitliche Begrenzung einer Implied Warranty. Daher gelten die vorstehenden Beschränkungen möglicherweise nicht für Sie. Sie gelten möglicherweise auch deshalb nicht für Sie, weil einige Länder unter Umständen keine zeitliche Begrenzung einer Implied Warranty oder Implied Guarantee gestatten. In DEUTSCHLAND und in ÖSTERREICH gibt es das Konzept der Implied Warranties oder Implied Guarantees, wie es im vorstehenden zweiten Unterabschnitt von Abschnitt B dargelegt ist, nicht. Zur Vermeidung jeglicher Zweifel wird klargestellt, dass Ihre gesetzlichen Rechte nach deutschem bzw. österreichischem Recht hierdurch weder ausgeschlossen noch eingeschränkt werden. C. GARANTIEAUSSCHLÜSSE. Diese Garantie deckt keine Probleme ab, die durch Ihre Handlungen (oder unterlassenen Handlungen), die Handlungen anderer oder Ereignisse außerhalb zumutbarer Einflussnahme von GIPSOFT verursacht werden. D. ANSPRÜCHE BEI VERLETZUNG DER GARANTIE. GIPSOFT wird die Software kostenlos nachbessern oder nachliefern. Wenn GIPSOFT sie nicht nachbessern oder nachliefern kann, wird GIPSOFT den Betrag zurückerstatten, der auf Ihrer Quittung für die Software ausgewiesen ist. GIPSOFT wird außerdem Ergänzungen, Updates und Ersatzsoftware kostenlos nachbessern oder nachliefern. Wenn GIPSOFT sie nicht nachbessern oder nachliefern kann, wird GIPSOFT den von Ihnen gegebenenfalls dafür gezahlten Betrag zurückerstatten. Sie sind verpflichtet, die Software zu deinstallieren und mit den dazugehörigen Medien und anderen Materialien und einem Kaufnachweis an GIPSOFT zurückzugeben, um eine Rückerstattung zu erhalten. Dies sind Ihre einzigen Ansprüche im Falle einer Verletzung der beschränkten Garantie. E. VERBRAUCHERRECHTE NICHT BERÜHRT. Möglicherweise haben Sie unter den örtlich anwendbaren Gesetzen zusätzliche Verbraucherrechte, die durch diesen Vertrag nicht abgeändert werden können. F. GARANTIEVERFAHREN. Für Garantieleistungen benötigen Sie einen Kaufnachweis. Für Garantieleistungen oder Informationen darüber, wie Sie eine Rückerstattung für die erworbene Software erhalten können, wenden Sie per E-Mail an GIPSOFT unter der Adresse info@gipsoft.eu. G. KEINE ANDEREN GARANTIEN. Die beschränkte Garantie ist die einzige direkte Garantie von GIPSOFT. GIPSOFT gewährt keine anderen ausdrücklichen Gewährleistungen oder Garantien. Im durch das örtlich anwendbare Recht gestatteten Umfang schließt GIPSOFT Implied Warranties der Handelsüblichkeit, Eignung für einen bestimmten Zweck und Nichtverletzung von Rechten Dritter aus. Wenn Ihnen das örtlich anwendbare Recht ungeachtet dieses Ausschlusses Implied Warranties oder Implied Guarantees gewährt, sind Ihre Ansprüche in der oben stehenden Klausel „Ansprüche bei Verletzung der Garantie“ beschrieben, soweit das örtlich anwendbare Recht dies gestattet. In DEUTSCHLAND und in ÖSTERREICH gibt es das Konzept der Implied Warranties oder Implied Guarantees, wie es in den beiden vorstehenden Sätzen dargelegt ist, nicht. Zur Vermeidung jeglicher Zweifel wird klargestellt, dass Ihre gesetzlichen Rechte nach deutschem bzw. österreichischem Recht hierdurch weder ausgeschlossen noch eingeschränkt werden. NUR FÜR AUSTRALIEN. In diesem Absatz verweist „Waren“ auf die Software, für die GIPSOFT ausdrücklich Garantie gewährt. Für unsere Waren gelten Garantien, die nach dem Australian Consumer Law nicht ausgeschlossen werden können. Bei einem wesentlichen Fehler haben Sie Anspruch auf einen Ersatz oder eine Erstattung, und bei anderen angemessen vorhersehbaren Verlusten oder Schäden haben Sie Anspruch auf eine Entschädigung. Außerdem haben Sie Anspruch auf Reparatur oder Austausch der Waren, wenn die Qualität der Waren nicht annehmbar ist und der Fehler keinen wesentlichen Fehler darstellt. Waren, die zur Reparatur eingereicht werden, können durch aufgearbeitete Waren desselben Typs ersetzt werden anstatt ausgetauscht zu werden. Aufgearbeitete Teile können zur Reparatur der Waren verwendet werden. H. BESCHRÄNKUNG UND AUSSCHLUSS DES SCHADENERSATZES FÜR VERLETZUNGEN DER GARANTIE. Die oben stehende Klausel „Beschränkung und Ausschluss des Schadenersatzes“ gilt für Verletzungen dieser beschränkten Garantie. Diese Garantie gewährt Ihnen bestimmte Rechte; möglicherweise stehen Ihnen je nach Staat weitergehende Rechte zu. Sie können auch von Land zu Land unterschiedliche weitergehende Rechte haben. In DEUTSCHLAND und in ÖSTERREICH werden die beiden vorstehenden Sätze folgendermaßen näher spezifiziert: Diese beschränkte Garantie verleiht Ihnen bestimmte Rechte zusätzlich zu Ihren gesetzlichen Rechten nach deutschem und österreichischem Recht.
