Repository: iplus-framework/iPlus
Catalog: gip.tool.installerAndUpdater/TextResources/TextResource.*.resx
Languages: de_de

# TbLoginInfo
source: Please login with your gip account. Enter a valid e-mail address and password.
de_de: Bitte melden Sie sich mit Ihren gip-Anmeldedaten an.

# TbLoginInfo2
source: Click Login to continue with installation.
de_de: Klicken Sie auf die <Login>-Taste um mit der Installation zu beginnen.

# TbLoginPassword
source: Password
de_de: Passwort

# TbProgramMaintHeader
source: iPlus installation and update program
de_de: iPlus Installations- und Aktualisierungsprogramm

# TbProgramMaintInfo
source: Choose an operation and click Next to continue
de_de: Bitte wählen Sie eine Option aus und klicken auf <Weiter>

# TbProgramMaintUninstall
source: Uninstall
de_de: Deinstallation

# TbProgramMaintUpdate
source: Update
de_de: Aktualisierung

# TbSqlCheckHeader
source: Searching for MSSQL Server
de_de: Suche nach MSSQL Server

# TbSqlCheckInfo
source: iPlus installer seraching for available MSSQL Servers ...
de_de: Suche nach verfügbaren MSSQL Servern ...

# TbSqlCheckInfo2
source: Search is completed. Click Next to continue.
de_de: Suche abgeschlossen. Dürcken Sie auf <Weiter> um fortzufahren.

# TbSqlCheckSearching
source: Searching ...
de_de: Suchen ...

# TbSqlCheckWarning
source: Warning
de_de: Warnung

# TbSqlCheckWarningServiceMissing
source: Windows service SQL Server Browser missing.
de_de: Der SQL Server-Browser Dienst ist nicht verfügbar.

# TbSqlCheckWarningServiceMissingInfo
source: iPlus installer needs SQL Server Browser service for searching available SQL servers. Click Next to continue to the next installation page where you'll need to manually enter a SQL server name.
de_de: Das Installationsprogramm benötigt den SQL Server-Browser Dienst um verfügbare SQL Server-Instanzen zu finden. Drücken Sie die <Weiter>-Taste um den SQL-Servernamen manuell einzugeben.

# TbSqlCheckWarningServiceNotRunning
source: Windows service SQL Server Browser not running.
de_de: Der SQL Server-Browser Dienst ist nicht gestartet.

# TbSqlCheckWarningServiceNotRunningInfo
source: iPlus installer needs SQL Server Browser service for searching available SQL servers. If you want to automatically search SQL servers, start the SQL Server-Browser service in Windows Service Management and click the Refresh button. Click Next if you want enter SQL server name manually.
de_de: Das Installationsprogramm benötigt den SQL Server-Browser Dienst um verfügbare SQL Server Instanzen zu finden. Falls Sie eine automatische Suche durchführen wollen müssen sie den SQL Server-Browser Dienst starten und anschliessend die <Aktualisieren>-Taste erneut drücken. Drücken Sie die <Weiter>-Taste um den SQL-Servernamen manuell einzugeben.

# TbUpdateChangeLogHeader
source: Update info
de_de: Aktualisierungsinformationen

# TbUpdateChangeLogInfo
source: Update change log
de_de: Änderungshistorie

# TbUpdateChangeLogInfoInstall
source: Click Install updates to start update ...
de_de: Drücken Sie auf <Aktualisierungen installieren> um den Aktualisierungsvorgang zu starten ...

# TbUpdateProgressCompleted
source: Update is completed. Click Start iPlus to apply update.
de_de: Aktualisierung abgeschlossen. Klicken Sie auf <iPlus starten> um die Aktualisierung zu aktivieren.

# TbUpdateProgressHeader
source: Update progress
de_de: Aktualisierungsfortschritt

# TbUpdateProgressInfo
source: Please wait, while iPlus updater completes the update action.
de_de: Bitte warten bis die Aktualisierung durchgeführt wurde.

# TbUpdateRollbackInfo
source: Click Next to continue ...
de_de: <Weiter> drücken um fortzufahren ...

# TbUpdateRollbackInfoAuto
source: Click Next to continue and please wait database connection ...
de_de: <Weiter> drücken um fortzufahren ...

# TbUpdateRollbackOptionsChoose
source: Choose Rollback option
de_de: Wählen Sie die Rollback-Option aus

# TbUpdateRollbackOptionsDescription
source: Rollback option description
de_de: Beschreibung der Rollback-Option

# TbFinishInfoRollback
source: Rollback is successfully completed.
de_de: Der Rollback wurde erfolgreich durchgeführt.

# MsgHeaderWarning
source: Warning
de_de: Warnung

# MsgRollbackDisabledNext
source: Are you sure? You will lose all your data!
de_de: Sind Sie sicher? Sie werden Ihre Daten verlieren!

# TbRollbackAutoDBFile
source: Available backup database files:
de_de: Verfügbare Datenbanksicherungsdateien

# TbRollbackAutoInfo
source: Click Next to continue with rollback....
de_de: <Weiter>-Taste klicken um mit dem Rollback zu beginnen ...

# TbRollbackAutoPrevVersion
source: Rollback application to previous version
de_de: Anwendung auf vorherige Programmversion zurücksetzen

# TbRollbackDBHeader
source: Rollback database connection
de_de: Datenbankverbindung zurücksetzen

# TbRollbackDBInfo
source: Click Next to continue with rollback operation ...
de_de: <Weiter>-Taste drücken um mit der Rollback-Operation fortzufahren ...

# TbRollbackDisabledChangeLog
source: Version changelog
de_de: Versions-Änderungshistorie

# TbRollbackDisabledChooseVersion
source: Choose version for rollback
de_de: Version auswählen auf die Sie zurückstellen möchten

# TbRollbackDisabledInfo
source: Rollback to initial application version with initial database. If you continue with rollback, you will lose all your data!
de_de: Rollback zu einer vorherigen Version. Es gehen alle Daten der aktuellen Version dabei verloren!

# TbRollbackDisabledInfo2
source: Click Next to continue with rollback ...
de_de: <Weiter>-Taste drücken um mit der Rollback-Operation fortzufahren ...

# BtnRollback
source: Rollback
de_de: Rückgängig

# BtnUninstall
source: Uninstall
de_de: Deinstallieren

# CbiRollbackManualAuto
source: Automatic
de_de: Automatisch

# CbiRollbackManualManual
source: Manual
de_de: Manuell

# MsgUpdateRollbackOptionHeader
source: Warning
de_de: Warnung

# MsgUpdateRollbackOptionText
source: Are you sure you want to continue?
de_de: Möchten Sie den Vorgang wirklich fortsetzen?

# OperationCompleteUpdate
source: Completing update ...
de_de: Aktualisierung fertigstellen ...

# OperationPrepareUpdate
source: Preparing to update ...
de_de: Vorbereitung der Aktualisierung ...

# OperationRollbackCompleted
source: Rollback is completed.
de_de: Rollback durchgeführt.

# OperationRollbackRestoreDatabase
source: Database restore in progress ...
de_de: Datenbankwiederherstellung aktiv ...

# OperationRollbackRestorePrevAppVersion
source: Restoring previous application version ...
de_de: Wiederherstellung der vorhergehenden Programmversion ...

# OperationRollbackStart
source: Rollback operation start ...
de_de: Rollbackvorgang gestartet ...

# OperationRollbackUninstallCurrentVersion
source: Uninstalling current application version ...
de_de: Deinstallation der aktuellen Programmversion ...

# OperationRollbackUnpackDatabase
source: Unpacking database ...
de_de: Entpacken des Datenbankarchivs ...

# RbUninstallRemoveUserDataNo
source: No
de_de: Nein

# RbUninstallRemoveUserDataYes
source: Yes
de_de: Ja

# TbRollbackManualDBFile
source: Choose database backup file (*.bak)
de_de: Datenbanksicherungsdatei auswählen (*.bak)

# TbRollbackManualDBRestoreOption
source: Choose database restore option
de_de: Datenbankwiederherstellungsoption auswählen

# TbRollbackManualInfo
source: Rollback application to previous version
de_de: Anwendung auf eine frühere Version zurücksetzen.

# TbRollbackManualInfo2
source: Click Rollback to start rollback operation.
de_de: <Rollback>-Taste drücken um mit dem Rollback zu beginnen ...

# TbRollbackProgressHeader
source: Rollback progress
de_de: Rollbackfortschritt

# TbRollbackProgressInfo
source: Please wait, rollback operation is in progress
de_de: Bitte warten, Rollback wird gerade ausgeführt.

# TbRollbackProgressRun
source: Rollback run ...
de_de: Rollback wird ausgeführt ...

# TbUninstallHeader
source: Uninstall
de_de: Deinstallation

# TbUninstallInfo
source: Click Uninstall to start the uninstallation.
de_de: Drücken Sie <Deinstallieren> um mit der Deinstallation zu beginnen.

# TbUninstallProgressHeader
source: Uninstall progress
de_de: Deinstallationsfortschritt

# TbUninstallProgressInfo
source: Uninstalling is in progress, please wait ...
de_de: Die Deinstallation wird durchgeführt, bitte warten ...

# TbUninstallProgressInfo2
source: Uninstall is finished. Click Finish to exit.
de_de: Deinstallation abgeschlossen. Drücken Sie auf <Fertig> um die Anwendung zu schließen.

# TbUninstallRemoveUserData
source: Remove user data?
de_de: Benutzerdaten löschen?

# MsgRollbackManualMissingFileHeader
source: Missing backup file
de_de: Sicherungsdatei nicht gefunden

# MsgRollbackManualMissingFileText
source: Missing database backup file! Please select a database backup file.
de_de: Datenbanksicherungsdatei nicht gefunden! Bitte wählen Sie eine Datenbanksicherungsdatei aus.

# MsgRollbackManualWrongFileTypeHeader
source: Wrong file type
de_de: Falscher Dateityp

# MsgRollbackManualWrongFileTypeText
source: Wrong file type! Please select appropriate file.
de_de: Falscher Dateityp! Bitte wählen Sie die richtige Datei aus.

# MsgUninstallHeader
source: Warning
de_de: Warnung

# MsgUninstallText
source: Are you sure, you want to uninstall application?
de_de: Möchten Sie die Anwendung wirklich deinstallieren?

# TbRollbackAppVersion
source: Rollback application version:
de_de: Rollback Programmversion:

# TbRollbackDisabledVersionUnavailable
source: Previous versions are unavailable.
de_de: Keine ältere Versionen vorhanden

# MsgRollbackManualHeader
source: Warning
de_de: Warnung

# MsgRollbackManualText
source: Are you sure, you want to continue? You will lose all data from the current application version!
de_de: Möchten Sie den Vorgang wirklich fortsetzen? Es gehen alle Daten der aktuellen Anwendungsversion dabei verloren!

# TbRollbackManualInfo2Next
source: Click Next to continue with rollback ...
de_de: <Weiter>-Taste drücken um mit der Rollback-Operation fortzufahren ...

# MsgBoxNo
source: No
de_de: Nein

# MsgBoxYes
source: Yes
de_de: Ja

# MsgConnecting
source: Connecting
de_de: Verbinden

# MsgDBUserOrPassEmpty
source: Username or password can't be empty!
de_de: Benutzername oder Kennwort darf nicht leer sein.

# MsgLoading
source: Loading
de_de: Laden

# MsgServerNameEmpty
source: Server name can't be empty!
de_de: Servername darf nicht leer sein!

# TbAllRightsReserved
source: gipSoft d.o.o. - All rights reserved.
de_de: gipSoft d.o.o. - Alle Rechte vorbehalten.

# TbHowToUseiPlus
source: How to use iPlus
de_de: So verwenden Sie iPlus

# TbUninstallFollowingFolder
source: {0} will be uninstalled from the following folder.
de_de: {0} wird aus dem folgenden Ordner deinstalliert.

# TbUninstallRemove
source: {0} will be removed from your Computer
de_de: {0} wird von Ihren PC entfernt.

# MsgDBAlreadyExist
source: {0} database already exist, please delete this database and click Yes to continue or No to skip this step.
de_de: {0} Datenbank existiert bereits, bitte löschen Sie diese Datenbank und klicken Sie auf Ja zum Fortsetzen oder auf Nein um diesen Schritt zu überspringen.

# TbUpdateRollbackAutoDBFile
source: Enter a database backup file name (*.bak)
de_de: Geben Sie einen Namen für die Datenbanksicherungsdatei ein (*.bak)

# TbUpdateRollbackDBHeader
source: Database backup - login
de_de: Datenbanksicherung - Login

# TbUpdateRollbackDBInfo
source: Click Next to continue or if you want skip this step click on Skip ...
de_de: Drücken Sie auf <Weiter> zum Fortsetzen oder <Überspringen> um diesen Schritt zu überspringen ...

# TbRollbackBackupFilePathInfo
source: Warning: If you use a remote SQL server, enter a backup file path from remote machine!
de_de: Warnung: Falls Sie Remote-Zugriff für den SQL Server verwenden geben Sie den Sicherungsdateipfad des Remoteservers an.

# MsgRollbackWrongBackupFileType
source: Backup file doesn´t end with .bak extension.
de_de: Sicherungsdatei muss vom Typ .bak sein

# TbUpdateApplicationStillRunning
source: {0} is running, please close the application before starting the updater.
de_de: {0} ist noch aktiv, schließen Sie die Anwendung bevor Sie mit dem Update beginnen.

# TbMicrosoftTrademark
source: SQL-Server® is a registred trademark of the Microsoft Corporation.
de_de: SQL-Server® ist ein eingetragenes Markenzeichen der Microsoft Corporation.
