Repository: iplus-framework/iPlus
Catalog: gip.tool.installerAndUpdater/TextResources/TextResource.*.resx
Languages: de_de

# BtnBack
source: Back
de_de: Zurück

# BtnBrowse
source: Browse
de_de: Durchsuchen

# BtnCancel
source: Cancel
de_de: Abbrechen

# BtnConfigure
source: Configure
de_de: Konfigurieren

# BtnExit
source: Exit
de_de: Beenden

# BtnFinish
source: Finish
de_de: Fertig

# BtnIAgree
source: I Agree
de_de: Zustimmen

# BtnInstall
source: Install
de_de: Installieren

# BtnInstallUpdates
source: Install updates
de_de: Aktualisieren

# BtnNext
source: Next
de_de: Weiter

# BtnRefresh
source: Refresh
de_de: Aktualisieren

# BtnSkipDB
source: Skip
de_de: Überspringen

# BtnStartVB
source: Start iPlus
de_de: iPlus starten

# CbDBAuthentication
source: Authentication
de_de: Authentifizierung

# ChDesktopShortcut
source: Create iPlus shortcut on desktop.
de_de: iPlus-Verknüpfung auf dem Desktop anlegen

# CheckForUpdateStatus1
source: Checking run ...
de_de: Überprüfung ...

# CheckForUpdateStatus2
source: Finished
de_de: Erledigt

# DBProgress0
source: Connecting to MSSQL Server.
de_de: Verbinde mit MSSQL Server.

# DBProgress10
source: Connected to MSSQL Server.
de_de: Verbunden mit MSSQL Server.

# DBProgress100
source: Configuration is finished. Click Next to continue.
de_de: Konfiguration fertiggstellt. <Weiter> klicken um fortzusetzen.

# DBProgress30
source: Database insert process started.
de_de: Datenbank wird angelegt.

# DBProgress70
source: Database insert process finished
de_de: Datenbank erfolgreich angelegt.

# DBProgress75
source: App.config has been configured
de_de: App.config wurde konfiguriert.

# ListRollbackOptionDisabled
source: Rollback disabled
de_de: Rollback deaktiviert

# ListRollbackOptionEnabledAutomatic
source: Rollback enabled (Automatic database backup)
de_de: Rollback aktiviert (Automatische Datenbanksicherung)

# ListRollbackOptionEnabledManual
source: Rollback enabled (Manual database backup)
de_de: Rollback aktiviert (Manuelle Datenbanksicherung)

# MsgCancel
source: Do you want cancel the installation process?
de_de: Möchten Sie die Installation abbrechen?

# MsgCancelHeader
source: Cancel installation
de_de: Installation abbrechen

# MsgCancelUpdate
source: Do you want cancel the update process?
de_de: Möchten Sie den Aktualisierungsvorgang abbrechen?

# MsgCancelUpdateHeader
source: Cancel update
de_de: Aktualisierung abbrechen

# MsgErrorHeader
source: Error
de_de: Fehler

# MsgLoginWrongCred
source: Wrong username or password! Try again with correct username and password.
de_de: Benutzername oder Kennwort ist falsch! Stellen Sie sicher, dass Benutzername und Passwort korrekt sind.

# MsgLoginWrongCredHeader
source: Wrong credentials
de_de: Falsche Anmeldedaten

# MsgSqlErrorNoConnection
source: Please check the SQL Server name, username and password if you use SQL server authentication.
de_de: Bitte überprüfen sie den SQL-Servernamen, Benutzernamen oder Kennwort falls Sie die SQL-Server Authentifizierung verwenden.

# MsgSqlErrorUserNotSysAdmin
source: Role of the current user is not serveradmin.
de_de: Dem Benutzer ist nicht die Serverbenutzerrolle sysadmin zugewiesen.

# OperationCancel
source: Cancellation installation ...
de_de: Installationsabbruch ...

# OperationCompleted
source: Completed.
de_de: Abgeschlossen.

# OperationCreateFolder
source: Creating installation folder ...
de_de: Installationsverzeichnis anlegen ...

# OperationDownloadApp
source: Downloading application ...
de_de: Anwendung herunterladen ...

# OperationDownloadDB
source: Downloading database ...
de_de: Datenbank herunterladen ...

# OperationDownloadUpdate
source: Downloading update ...
de_de: Aktualisierung herunterladen ...

# OperationFinishUpdate
source: Completed.
de_de: Abgeschlossen.

# OperationSetShortcut
source: Setting desktop shortcut ...
de_de: Desktop-Verknüpfung erstellen ...

# OperationUnpackApp
source: Unpacking application ...
de_de: Anwendungsarchiv entpacken ...

# OperationUnpackDB
source: Unpacking database ...
de_de: Entpacken des Datenbankarchivs ...

# OperationUnpackUpdate
source: Unpacking update ...
de_de: Aktualisierungsdateien entpacken ...

# RollbackOptionDescriptionDisabled
source: Option rollback disabled - restores application to previously available versions with initial database. You will lose all data from the application, including application configuration(App.config). This option is not recommended.
de_de: Rollback-Option deaktiviert: Ermöglicht die Wiederherstellung einer vorherigen Programmversion mit einer leeren Datenbank. Sie werden alle Daten verlieren, einschließlich der Anwendungskonfiguration(App.config). Diese Option wird nicht empfohlen.

# RollbackOptionDescriptionEnabledManual
source: Option rollback enabled with manual database backup - provides restore application to previous version with all your data. Please backup your database NOW, then continue with update! If you don't backup your database, you will lose all your data.
de_de: Rollback-Option aktiviert mit manueller Datenbanksicherung: Ermöglicht die Wiederherstellung zur vorherigen Programmversion mit Ihren Anwendungsdaten. Bitte führen Sie die Datenbanksicherung jetzt durch und setzen die Aktualisierung dann fort! Falls Sie die Datenbank-Sicherung nicht durchführen werden Sie Ihre Daten verlieren.

# RollbackOptionDescriptionEnabledAutomatic
source: Option rollback enabled with automatic database backup - restores application to previous version with all your data. This option requires database login with the user role sysadmin.
de_de: Rollback-Option aktiviert mit automatischer Datenbanksicherung: Ermöglicht die Wiederherstellung zur vorherigen Programmversion mit der zuletzt gesicherten Datenbank. Diese Option erfordert eine Datenbankanmeldung mit der Serverbenutzerrolle sysadmin.

# TbApplicationVersion
source: Please select which version of iPlus you want install.
de_de: Bitte wählen Sie die iPlus-Version aus, die Sie installieren möchten.

# TbCheckForUpdateAvailableNewUpdates
source: New application version is available. Click Next to continue with update.
de_de: Eine neue Programmversion ist verfügbar. Klicken Sie auf <Weiter> um die Aktualisierung durchzuführen.

# TbCheckForUpdateHeader
source: Update
de_de: Aktualisierung

# TbCheckForUpdateInfo
source: Updater checking for iPlus updates ...
de_de: Suche nach Aktualisierungen ...

# TbCheckForUpdateNoNewUpdates
source: Your application is up to date. Click Exit to close updater.
de_de: Ihre Anwendung ist auf dem neuesten Stand. Klicken Sie <Beenden> um das Aktualisierungsprogramm zu schließen.

# TbDBHeader
source: Database configuration
de_de: Datenbank Konfiguration

# TbDBInfo
source: Please enter required MSSQL Server information. The server role of the user must be sysadmin.
de_de: Bitte geben Sie die erforderlichen SQL-Server-Informationen ein. Der Benutzer muss dafür der Serverbenutzerrolle sysadmin zugeordnet sein.

# TbDBInfo2
source: Click Configure for automatic configuration of the App.config file and automatic insert of the iPlus database into MSSQL Server. If you want to manually configure the App.config and insert the database into MSSQL server, click Skip.
de_de: Klicken Sie auf <Konfigurieren> für die automatische Einrichtung der App.config-Datei und der Datenbankerstellung im SQL-Server. Falls Sie die App.config manuell konfigurieren und die Datenbank manuell anlegen möchten klicken Sie auf <Überspringen>.

# TbDBProgress
source: Configuration progress
de_de: Konfigurationsfortschritt

# TbDBProgressInfo
source: Please wait, while iPlus installer finishes the database configuration.
de_de: Bitte warten Sie bis das Installationsprogramm die Datenbankeinrichtung durchgeführt hat.

# TbDBServerPassword
source: Password
de_de: Passwort

# TbDBServerUserName
source: User name
de_de: Benutzername

# TbDestinationFolder
source: Destination folder
de_de: Zielordner

# TbFinishHeader
source: End
de_de: Ende

# TbFinishInfo
source: Installation is successfully completed.
de_de: Die Installation wurde erfolgreich durchgeführt.

# TbInstallHeader
source: Install options
de_de: Installationsoptionen

# TbInstallLocationInfo
source: Setup will install iPlus in the following folder. To install in a different folder click Browse and select another folder.
de_de: IPlus wird in den folgenden Ordner installiert. Klicken Sie <Durchsuchen> um einen anderen Installationsordner auszuwählen.

# TbInstallProgressCompleted
source: Installation is completed. Click Next to continue.
de_de: Installation abgeschlossen. <Weiter> klicken um fortzufahren.

# TbInstallProgressHeader
source: Installation progress
de_de: Installationsfortschritt

# TbInstallProgressInfo
source: Please wait, while iPlus installer completes the installation.
de_de: Bitte warten Sie bis der Installationsvorgang abgeschlossen ist.

# TbInstallTotalProgress
source: Total progress
de_de: Gesamtfortschritt

# TbLicenseAgreement
source: License Agreement
de_de: Lizenzabkommen

# TbLicenseInfo
source: Please review the license terms before installing iPlus.
de_de: Bitte lesen Sie die Lizenzbedingungen durch bevor Sie iPlus installieren.

# TbLicenseInfo2
source: If you accept the terms of the agrement, click I agree to continue. You must accept the agreement to install iPlus.
de_de: Um die Lizenzbedingungen zu akzeptieren drücken Sie die <Zustimmen>-Taste. Sie müssen den Lizenzbedingungen zustimmen um iPlus installieren zu können.
